app/views/books/index.html.erb

            <td><%= render "favorite", book: book %></td><!--いいね部分テンプレ-->
            <td><%= book.book_comments.count %>コメント</td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]