app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    @user = current_user
    if @book.save
    redirect_to book_path(@book.id), notice: "本を投稿"
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "ワンピース"], ["body", "面白い"], ["created_at", "2020-10-07 12:46:18.766782"], ["updated_at", "2020-10-07 12:46:18.766782"], ["user_id", 1]]
SELECT "books".* FROM "books"