app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @user = current_user
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @book = Book.new
    @books = Book.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "b4b1f1f17067bffcdf5ea59b856223be6c1d2604d413dd6a22d96dd858e6"], ["introduction", "どうも！"], ["updated_at", "2020-10-07 12:47:04.268645"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)